#pragma once
/*
--------------------------------------------------
					システムモード
--------------------------------------------------
*/
#define TITLE					3001		//タイトルであることを示すモード


/*
--------------------------------------------------
					マップ時モード
 -------------------------------------------------
 */

#define MAP_NORMAL				1		//通常マップでの挙動
#define MAP_HAJIET				2		//ハジート村
#define MAP_HILBATE				3		//ヒルベート王国
#define MAP_TEATURE				4		//先生の場所


/*
---------------------------------------------------
					戦闘時モード
---------------------------------------------------
*/
#define BATTLE_START			1001	//戦闘開始
#define BATTLE_DO_SELECT		1002	//戦闘時プレイヤー全体の行動選択
#define BATTLE_MOVE_PLAYER		1003	//戦闘時ターンプレイヤーの移動選択
#define BATTLE_ATTACK_PLAYER	1004	//戦闘時ターンプレイヤーの攻撃
#define BATTLE_ATTACK_SELECT	1005	//戦闘時ターンプレイヤーの攻撃選択
#define BATTLE_DO_PLAYER		1006	//戦闘時ターンプレイヤーの行動選択
#define BATTLE_ENEMY_TURN		1007	//戦闘時エネミーだけが行動する場合。
#define BATTLE_ENEMY_MOVE		1008	//戦闘時ターンエネミーの移動
#define BATTLE_ENEMY_ATTACK		1009	//戦闘時ターンエネミーの攻撃
#define BATTLE_END				1010	//戦闘終了


/*
----------------------------------------------------
				  メニュー時モード
----------------------------------------------------
*/

/*
----------------------------------------------------
					描画モード
----------------------------------------------------
*/
#define DRAW_BATTLE				5002	//戦闘時描画

/*
----------------------------------------------------
プレイヤーid
----------------------------------------------------
*/
#define ALLEN		10001	//アレンのID
#define CRAIG		10002	//クレイグのID
#define IMITIA		10003	//イミティアのID
#define RAIN		10004	//レインのID


/*
-----------------------------------------------------
					アイテム
-----------------------------------------------------
*/

/*
装備品
*/
#define WOODSWORD	50001	//木剣のID

/*
消耗品
*/
#define	PORTION		52001	//回復薬のID

/*
------------------------------------------------------
						マップ
------------------------------------------------------
*/

//ワールドマップ
#define WORLD_GRASS			60000	//ワールドマップの草原
#define WORLD_GRAND			60001	//ワールドマップの地面
#define WORLD_FOREST		60002	//ワールドマップの森
#define WORLD_MOUNTAIN		60003	//ワールドマップの山脈
#define WORLD_OCEAN			60004	//ワールドマップの海
#define WORLD_SMALL_TOWN	60005	//ワールドマップの小さな町
#define WORLD_BIG_TOWN		60006	//ワールドマップの大きな町
#define WORLD_CASTLE		60007	//ワールドマップの城
#define WORLD_BRIGE			60008	//ワールドマップの橋


/*
---------------------------------------------------------
					敵の出現テーブル
---------------------------------------------------------
*/

#define ENCOUNT_FIRST_NORMAL		71001	//1章の通常時
#define ENCOUNT_FIRST_TOWN			71002	//1章の村炎上時の敵
#define ENCOUNT_FIRST_DANJON		71003	//1章のダンジョンの敵
#define ENCOUNT_FIRST_BOSS			71004	//1章の中ボス