#pragma once

enum ID {
	/*
	--------------------------------------------------
						システムモード
	--------------------------------------------------
	*/
	UNDIFINED	=	1000000,	//デフォルト値
	TITLE		=	3001,		//タイトルであることを示すモード


	/*
	--------------------------------------------------
					マップ時モード
	-------------------------------------------------
	*/

	MAP_NORMAL		=	1,		//通常マップでの挙動
	MAP_HAJIET		=	2,		//ハジート村
	MAP_HILBATE		=	3,		//ヒルベート王国
	MAP_TEATURE		=	4,		//先生の場所


	/*
	---------------------------------------------------
						戦闘時モード
	---------------------------------------------------
	*/
	BATTLE_START			=	1001,	//戦闘開始
	BATTLE_DO_SELECT		=	1002,	//戦闘時プレイヤー全体の行動選択
	BATTLE_MOVE_PLAYER		=	1003,	//戦闘時ターンプレイヤーの移動選択
	BATTLE_ATTACK_PLAYER	=	1004,	//戦闘時ターンプレイヤーの攻撃
	BATTLE_ATTACK_SELECT	=	1005,	//戦闘時ターンプレイヤーの攻撃選択
	BATTLE_DO_PLAYER		=	1006,	//戦闘時ターンプレイヤーの行動選択
	BATTLE_ENEMY_TURN		=	1007,	//戦闘時エネミーだけが行動する場合。
	BATTLE_ENEMY_MOVE		=	1008,	//戦闘時ターンエネミーの移動
	BATTLE_ENEMY_ATTACK		=	1009,	//戦闘時ターンエネミーの攻撃
	BATTLE_END				=	1010,	//戦闘終了


	/*
	----------------------------------------------------
					メニュー時モード
	----------------------------------------------------
	*/

	/*
	----------------------------------------------------
						描画モード
	----------------------------------------------------
	*/
	DRAW_BATTLE		=	5002,	//戦闘時描画

	/*
	----------------------------------------------------
	プレイヤーid
	----------------------------------------------------
	*/
	ALLEN	=	10001,	//アレンのID
	CRAIG	=	10002,	//クレイグのID
	IMITIA	=	10003,	//イミティアのID
	RAIN	=	10004,	//レインのID

	/*
	-----------------------------------------------------
	                    敵データ
	-----------------------------------------------------
	*/
	HORNRABIT = 31001, //一角ウサギ

	/*
	-----------------------------------------------------
						アイテム
	-----------------------------------------------------
	*/

	/*
	装備品
	*/
	NOTEQUIPMENT	=	50000,	//未装備
	WOODSWORD		=	50001,	//木剣のID
	STONESWORD		=	50002,	//石剣のID
	STEALSWORD		=	50003,	//鉄剣のID
	STEALLANCE		=	50004,	//鉄やりのID
	LEATHERCAP		=	51001,	//皮の帽子のID
	LEATHERCHEST	=	51002,	//皮の胸当てのID
	LEATHERSHIELD	=	51003,	//皮の盾のID
	LEATHERARM		=	51004,	//皮の籠手のID

	
	/*
	消耗品
	*/
	PORTION		=	52001,	//回復薬のID

	/*
	------------------------------------------------------
							マップ
	------------------------------------------------------
	*/

	//ワールドマップ
	WORLD_GRASS			=	60000,	//ワールドマップの草原
	WORLD_GRAND			=	60001,	//ワールドマップの地面
	WORLD_FOREST		=	60002,	//ワールドマップの森
	WORLD_MOUNTAIN		=	60003,	//ワールドマップの山脈
	WORLD_OCEAN			=	60004,	//ワールドマップの海
	WORLD_SMALL_TOWN	=	60005,	//ワールドマップの小さな町
	WORLD_BIG_TOWN		=	60006,	//ワールドマップの大きな町
	WORLD_CASTLE		=	60007,	//ワールドマップの城
	WORLD_BRIGE			=	60008,	//ワールドマップの橋


	/*
	---------------------------------------------------------
					敵の出現テーブル
	---------------------------------------------------------
	*/

		ENCOUNT_FIRST_NORMAL	=	71001,	//1章の通常時
		ENCOUNT_FIRST_TOWN		=	71002,	//1章の村炎上時の敵
		ENCOUNT_FIRST_DANJON	=	71003,	//1章のダンジョンの敵
		ENCOUNT_FIRST_BOSS		=	71004,	//1章の中ボス


	/*
	----------------------------------------------------------
					魔術
	----------------------------------------------------------
	*/

		FIREBALL	=	81001,
		HEAL		=	81002,


	/*
	-----------------------------------------------------------
						イベント
	-----------------------------------------------------------
	*/

		HAJITO		=	90001,
		TEATURE		=	90002,
		HILBATE		=	90003,
		HOUSE		=	90004

};